{
  "devopsItems": [
    {
      "title": "Raspberry Pi Projects",
      "date": "Ongoing",
      "info": "In my free time, I have explored various DevOps-related tasks using Raspberry Pi devices. This includes installing and configuring Pi-hole for network-wide ad blocking, setting up Nginx and MySQL servers, and experimenting with lightweight operating systems like DietPi on Debian and Ubuntu-based distributions. These projects helped me deepen my understanding of system administration and network configuration in a resource-constrained environment.",
      "skills": ["Raspberry Pi", "Pi-hole", "Nginx", "MySQL", "DietPi", "Debian", "Ubuntu"]
    },
    {
      "title": "TEB EDUKACJA",
      "date": "10.2022",
      "info": "As a DevOps contributor, I was assigned two key tasks. First, I configured and deployed Nginx across the entire building's infrastructure to serve as a reliable and centralized web server. Second, I established socket-based communication between PHP and Java applications, ensuring seamless interoperability and stable data exchange between the two systems.",
      "skills": ["Ubuntu", "Java", "PHP", "Nginx", "Networking"]
    },
    {
      "title": "AbexGuilds",
      "date": "03.2024",
      "info": "In this project, I was responsible for deploying and maintaining, and updating the AbexGuilds system in a production environment, serving over 700 users. The system handled in-game guild management, requiring high availability and performance. I configured the server stack using Laravel, Nginx, MySQL, and Ubuntu, and ensured stable operation under real user load.",
      "skills": ["Laravel", "Nginx", "MySQL", "Ubuntu", "PHP"]
    },
    {
      "title": "Rezervo",
      "date": "01.2025",
      "info": "As part of my DevOps responsibilities, I successfully deployed, updated and maintained the Rezervo project to a production environment. I containerized the application using Docker and configured on a Debian-based server. I also conducted several tests to ensure the system's reliability and performance in the live environment.",
      "skills": ["GitHub Actions", "DigitalOcean", "Docker", "PHP", "MySQL" ]
    }
  ]
}